export const days = [
  { key: "mon", label: "Даваа" },
  { key: "tue", label: "Мягмар" },
  { key: "wed", label: "Лхагва" },
  { key: "thu", label: "Пүрэв" },
  { key: "fri", label: "Баасан" },
];

export const schedule = {
  mon: [
    {
      time: "10:00-11:30",
      subject: "Цахим аюулгүй байдал",
      type: "лекц",
      room: "ШМТИС 809",
      teacher: "Төгөлдөр",
    },
    {
      time: "11:40-13:10",
      subject: "Мобайл програмчлал",
      type: "лекц",
      room: "ШМТИС 809",
      teacher: "Ц.Солонгоо",
    },
    {
      time: "14:00-15:30",
      subject: "Пайтон програмчлал ба өгөгдлийн шинжилгээ",
      type: "лаборатор",
      room: "ШМТИС 913",
      teacher: "Ц.Солонгоо",
    },
    {
      time: "15:40-17:10",
      subject: "",
      type: "лаборатор",
      room: "ШМТИС 913",
      teacher: "Төгөлдөр",
    },
  ],
  tue: [],
  wed: [
    {
      time: "8:20-9:50",
      subject: "Мобайл програмчлал",
      type: "лаборатор",
      room: "ШМТИС 913",
      teacher: "Ц.Солонгоо",
    },
    {
      time: "10:00-11:30",
      subject: "Хиймэл оюун ухааны үндэс ба машин сургалт",
      type: "лекц",
      room: "ШМТИС 711",
      teacher: "Н.Анхбаяр",
    },
    {
      time: "11:40-13:10",
      subject: "Магадлал ба статистик",
      type: "семинар",
      room: "ШМТИС 712",
      teacher: "Б.Санчир",
    },
    {
      time: "14:00-15:30",
      subject: "Магадлал ба статистик",
      type: "лекц",
      room: "ШМТИС 711",
      teacher: "Б.Санчир",
    },
  ],
  thu: [],
  fri: [
    {
      time: "8:20-9:50",
      subject: "Пайтон програмчлал ба өгөгдлийн шинжилгээ",
      type: "лекц",
      room: "ШМТИС 913",
      teacher: "Ц.Солонгоо",
    },
    {
      time: "10:00-11:30",
      subject: "Компьютерийн сүлжээ",
      type: "лекц",
      room: "ШМТИС 809",
      teacher: "Б.Ганзориг",
    },
    {
      time: "11:40-13:10",
      subject: "Компьютерийн сүлжээ",
      type: "лаборатор",
      room: "ШМТИС 913",
      teacher: "Б.Ганзориг",
    },
    {
      time: "14:00-15:30",
      subject: "Хиймэл оюун ухааны үндэс ба машин сургалт",
      type: "лаборатор",
      room: "ШМТИС 912",
      teacher: "Н.Анхбаяр",
    },
  ],
};
